extern crate rand;

use rand::Rng;

fn main() {
    let elements0 = ["Б", "В", "Г", "Д", "Ђ", "Ж", "З", "Ј", "К", "Л", "Љ", "М", "Н", "Њ", "П", "Р",
        "С", "Т", "Ћ", "Ф", "Х", "Ц", "Ч", "Џ", "Ш", "Б", "В", "Г", "Д", "Ђ", "Ж", "З",
        "Ј", "К", "Л", "Љ", "М", "Н", "Њ", "П", "Р", "С", "Т", "Ћ", "Ф", "Х", "Ц", "Ч",
        "Џ", "Ш", "Бл", "Бр", "Вл", "Вр", "Гл", "Гр", "Дл", "Др", "Жл", "Зл", "Зр",
        "Кр", "Кл", "Мр", "Мл", "Пј", "Пл", "Пљ", "Пњ", "Пр", "Св", "Сл", "См", "Сп",
        "Ст", "Тл", "Тр", "Фл", "Фљ", "Фњ", "Фр", "Хл", "Хр"];
    let elements1 = ["а", "е", "и", "о", "у", "р"];
    let elements2 = ["б", "в", "г", "д", "ђ", "ж", "з", "ј", "к", "л", "љ", "м", "н", "њ", "п", "р",
        "с", "т", "ћ", "ф", "х", "ц", "ч", "џ", "ш"];

    let e0 = rand::thread_rng().choose(&elements0).unwrap();
    let e1 = rand::thread_rng().choose(&elements1).unwrap();
    let e2 = rand::thread_rng().choose(&elements2).unwrap();

    println!("{}{}{}о Полумента", &e0, &e1, &e2);
}
